# Part_1 (Customer Data wrangling and Merging)

In [1]:
# Importing libraries
import pandas as pd
import numpy as np
import os
import matplotlib.pyplot as plt
import seaborn as sns
import scipy

In [5]:
# establishing a path
path = r'C:\Users\shanz\Downloads\MM-2020 Instacart Basket Analysis'

In [7]:
# Import new 'customer.csv' dataframe.
customers = pd.read_csv(os.path.join(path, 'Data', 'Original data', 'customers.csv'))

## Step_1

In [8]:
customers.head(10)

,user_id,First Name,Surnam,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374
5,133128,Cynthia,Noble,Female,Kentucky,43,1/1/2017,2,married,49643
6,152052,Chris,Walton,Male,Montana,20,1/1/2017,0,single,61746
7,168851,Joseph,Hickman,Male,South Carolina,30,1/1/2017,0,single,63712
8,69965,Jeremy,Vang,Male,Texas,47,1/1/2017,1,married,162432
9,82820,Shawn,Chung,Male,Virginia,26,1/1/2017,2,married,32072

In [9]:
customers.shape

(206209, 10)

In [10]:
customers.describe()

             user_id            Age   n_dependants         income
count  206209.000000  206209.000000  206209.000000  206209.000000
mean   103105.000000      49.501646       1.499823   94632.852548
std     59527.555167      18.480962       1.118433   42473.786988
min         1.000000      18.000000       0.000000   25903.000000
25%     51553.000000      33.000000       0.000000   59874.000000
50%    103105.000000      49.000000       1.000000   93547.000000
75%    154657.000000      66.000000       3.000000  124244.000000
max    206209.000000      81.000000       3.000000  593901.000000

In [11]:
# Check datatypes.
customers.dtypes

user_id          int64
First Name      object
Surnam          object
Gender          object
STATE           object
Age              int64
date_joined     object
n_dependants     int64
fam_status      object
income           int64
dtype: object

# Wrangle the Dataset

In [12]:
# Rename the columns.
customers.rename(columns = {'First Name' : 'first_name'}, inplace = True)

In [13]:
customers.rename(columns = {'Surnam' : 'surname'}, inplace = True)

In [14]:
customers.rename(columns = {'Gender' : 'gender'}, inplace = True)

In [15]:
customers.rename(columns = {'Age' : 'age'}, inplace = True)

In [16]:
customers.rename(columns ={'STATE' : 'state'}, inplace = True)

In [17]:
customers.rename(columns = {'fam_status' : 'marital_status'}, inplace = True)

In [18]:
# Check columns.
customers.columns

Index(['user_id', 'first_name', 'surname', 'gender', 'state', 'age',
       'date_joined', 'n_dependants', 'marital_status', 'income'],
      dtype='object')

In [19]:
customers.head()

,user_id,first_name,surname,gender,state,age,date_joined,n_dependants,marital_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

# Data Quality and Consistency check

In [20]:
# Check data types and mixed data types in dataframe.
customers.dtypes

user_id            int64
first_name        object
surname           object
gender            object
state             object
age                int64
date_joined       object
n_dependants       int64
marital_status    object
income             int64
dtype: object

In [21]:
# Checking for mixed data types in each column.
for col in customers.columns.tolist():
    weird = (customers[[col]].map(type) != customers[[col]].iloc[0].apply(type)).any(axis = 1)
    if len (customers[weird]) > 0:
        print (col)

first_name

In [22]:
# Output shows that 'first_name' column have mixed data-types that need to be addressed.
customers['first_name'] = customers['first_name'].astype('str')

In [23]:
# 'user_id' column, while not containing mixed data-types, is till improperly listed as an integer
customers['user_id'] = customers['user_id'].astype('str')

In [24]:
customers.dtypes

user_id           object
first_name        object
surname           object
gender            object
state             object
age                int64
date_joined       object
n_dependants       int64
marital_status    object
income             int64
dtype: object

In [25]:
for col in customers.columns.tolist():
    weird = (customers[[col]].map(type) != customers[[col]].iloc[0].apply(type)).any(axis = 1)
    if len (customers[weird]) > 0:
        print (col)

In [26]:
# Check for missing data.
customers.isnull().sum()

user_id           0
first_name        0
surname           0
gender            0
state             0
age               0
date_joined       0
n_dependants      0
marital_status    0
income            0
dtype: int64

In [27]:
# Check for full duplicates.
customers_dups = customers[customers.duplicated()]

In [28]:
customers_dups

Empty DataFrame
Columns: [user_id, first_name, surname, gender, state, age, date_joined, n_dependants, marital_status, income]
Index: []

In [29]:
# check Descriptive statistics.
customers.describe()

                 age   n_dependants         income
count  206209.000000  206209.000000  206209.000000
mean       49.501646       1.499823   94632.852548
std        18.480962       1.118433   42473.786988
min        18.000000       0.000000   25903.000000
25%        33.000000       0.000000   59874.000000
50%        49.000000       1.000000   93547.000000
75%        66.000000       3.000000  124244.000000
max        81.000000       3.000000  593901.000000

# Combine customer data with the prepared instacart data

In [32]:
# Import dataframe.
orders_products = pd.read_pickle(os.path.join(path, 'Data', 'Prepared data', 'orders_products_merged_aggregated.pkl'))

In [33]:
# Check shape.
orders_products.shape

(16063394, 23)

In [34]:
# Check shape.
customers.shape

(206209, 10)

In [35]:
# Identify shared column.
orders_products.head(5)

,Unnamed: 0,product_id,product_name,aisle_id,department_id,prices,order_id,user_id,order_number,order_dow,...,reordered,_merge,price_range_loc,busiest_period_of_day,max_order,loyalty_flag,average_spend,spender_flag,Customer_frequency,frequency_flag
0,0,1,Chocolate Sandwich Cookies,61,19,5.8,3139998,138,28,6,...,0,both,Mid range product,Most orders,32,Regular customer,8.206897,Low_spender,8.0,Frequent Customer
1,1,1,Chocolate Sandwich Cookies,61,19,5.8,1977647,138,30,6,...,1,both,Mid range product,Average orders,32,Regular customer,8.206897,Low_spender,8.0,Frequent Customer
2,2,1,Chocolate Sandwich Cookies,61,19,5.8,389851,709,2,0,...,0,both,Mid range product,Average orders,5,New customer,8.292373,Low_spender,7.0,Frequent Customer
3,3,1,Chocolate Sandwich Cookies,61,19,5.8,652770,764,1,3,...,0,both,Mid range product,Most orders,3,New customer,4.987097,Low_spender,9.0,Frequent Customer
4,4,1,Chocolate Sandwich Cookies,61,19,5.8,1813452,764,3,4,...,1,both,Mid range product,Average orders,3,New customer,4.987097,Low_spender,9.0,Frequent Customer

In [36]:
customers.head(5)

,user_id,first_name,surname,gender,state,age,date_joined,n_dependants,marital_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [37]:
# Both datframes share the 'user_id' column
# Check data-type of shared column
orders_products.dtypes['user_id']

dtype('int64')

In [38]:
customers.dtypes['user_id']

dtype('O')

In [39]:
# Make both dataframes of same data-type
orders_products['user_id'] = orders_products['user_id'].astype('str')

In [40]:
orders_products.dtypes['user_id']

dtype('O')

In [41]:
# Now both dataframes have same data-type

In [42]:
# Drop the existing '_merge' column from previous exercise
orders_products = orders_products.drop(columns=['_merge'])

In [43]:
# Merge both dataframes using the column 'user_id' as the shared column with the default join (inner)

In [44]:
cust_ords_prods = orders_products.merge(customers, on = 'user_id', indicator = True)

In [45]:
# This new dataframe combines both the customers data and orders_products dataframe and use the 'user_id' column as its key

In [46]:
# Check shape
cust_ords_prods.shape

(16063394, 32)

In [47]:
cust_ords_prods.head(5)

,Unnamed: 0,product_id,product_name,aisle_id,department_id,prices,order_id,user_id,order_number,order_dow,...,first_name,surname,gender,state,age,date_joined,n_dependants,marital_status,income,_merge
0,0,1,Chocolate Sandwich Cookies,61,19,5.8,3139998,138,28,6,...,Charles,Cox,Male,Minnesota,81,8/1/2019,1,married,49620,both
1,1,1,Chocolate Sandwich Cookies,61,19,5.8,1977647,138,30,6,...,Charles,Cox,Male,Minnesota,81,8/1/2019,1,married,49620,both
2,2,1,Chocolate Sandwich Cookies,61,19,5.8,389851,709,2,0,...,Deborah,Glass,Female,Vermont,66,6/16/2018,2,married,158302,both
3,3,1,Chocolate Sandwich Cookies,61,19,5.8,652770,764,1,3,...,Heather,Myers,Female,Wisconsin,40,2/9/2020,3,married,31308,both
4,4,1,Chocolate Sandwich Cookies,61,19,5.8,1813452,764,3,4,...,Heather,Myers,Female,Wisconsin,40,2/9/2020,3,married,31308,both

In [48]:
# Check inner join value counts
cust_ords_prods['_merge'].value_counts()

_merge
both          16063394
left_only            0
right_only           0
Name: count, dtype: int64

In [49]:
# Check data types
cust_ords_prods.dtypes

Unnamed: 0                   int64
product_id                   int64
product_name                object
aisle_id                     int64
department_id                int64
prices                     float64
order_id                     int64
user_id                     object
order_number                 int64
order_dow                    int64
order_hour_of_day            int64
days_since_prior_order     float64
add_to_cart_order            int64
reordered                    int64
price_range_loc             object
busiest_period_of_day       object
max_order                    int64
loyalty_flag                object
average_spend              float64
spender_flag                object
Customer_frequency         float64
frequency_flag              object
first_name                  object
surname                     object
gender                      object
state                       object
age                          int64
date_joined                 object
n_dependants                 int64
marital_status              object
income                       int64
_merge                    category
dtype: object

## Export Dataframe:

In [50]:
cust_ords_prods.to_pickle(os.path.join(path, 'Data', 'Prepared data', 'orders_products_customers_merged.pkl'))